app/views/carts/show.html.erb

  <tbody>
    <% @cart.cart_items.each do |item| %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]