app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "author", "description", "price", "stock_quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "stock_quantity" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["stock_quantity", 4], ["updated_at", "2024-06-03 09:08:02.746180"], ["id", 1]]

  def destroy
    @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 2]]