app/controllers/books_controller.rb

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "Updated Title"], ["updated_at", "2024-06-07 06:42:38.110908"], ["id", 8]]