app/controllers/carts_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]
UPDATE "books" SET "stock_quantity" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["stock_quantity", 2], ["updated_at", "2024-06-03 09:22:16.720610"], ["id", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 1]]
---
  def complete_order
    @cart.cart_items.each do |item|
      book = item.book
      book.stock_quantity -= item.quantity
      book.save
    end
    @cart.cart_items.destroy_all