app/controllers/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."book_id" = $2 LIMIT $3  [["cart_id", 1], ["book_id", 3], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 2], ["updated_at", "2024-06-07 13:08:12.909004"], ["id", 28]]
---
  def create
    @cart_item = @cart.cart_items.find_or_initialize_by(book_id: params[:cart_item][:book_id])
    book = Book.find(params[:cart_item][:book_id])

    if book.stock_quantity == 0
      redirect_to @cart, alert: 'Book is out of stock.'
      return
    end

    requested_quantity = params[:cart_item][:quantity].to_i
    available_quantity = book.stock_quantity - @cart_item.quantity

    if requested_quantity > available_quantity
      @cart_item.quantity += available_quantity
      message = "Only #{available_quantity} out of #{requested_quantity} books were added to the cart due to limited stock."
    else
      @cart_item.quantity += requested_quantity
      message = 'Book was successfully added to cart.'
    end

    if @cart_item.save

UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 3], ["updated_at", "2024-06-07 10:26:34.680382"], ["id", 26]]
---
  def update
    requested_quantity = params[:cart_item][:quantity].to_i
    book = @cart_item.book

    if book.stock_quantity == 0
      redirect_to @cart, alert: 'Book is out of stock.'
      return
    end

    available_quantity = book.stock_quantity + @cart_item.quantity - requested_quantity

    if requested_quantity > available_quantity
      @cart_item.quantity = book.stock_quantity
      message = "Only #{available_quantity} out of #{requested_quantity} books can be updated in the cart due to limited stock."
    else
      @cart_item.quantity = requested_quantity
      message = 'Cart item was successfully updated.'
    end

    if @cart_item.save

DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 19]]
---
  def destroy
    @cart_item.destroy

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."id" = $2 LIMIT $3  [["cart_id", 1], ["id", 26], ["LIMIT", 1]]
---
  def set_cart_item
    @cart_item = @cart.cart_items.find(params[:id])