app/models/user.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["created_at", "2024-06-05 11:11:30.459543"], ["updated_at", "2024-06-05 11:11:30.459543"]]
---
  def create_cart
    Cart.create(user: self)